Codes/Rails/Rails-Instagram-Demo/app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "post_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["post_id", 3], ["content", "Nice Car"], ["created_at", 2017-05-10 05:48:15 UTC], ["updated_at", 2017-05-10 05:48:15 UTC]]
---
	def create
		@comment = @post.comments.build(comment_params)
		@comment.user_id = current_user.id

		if @comment.save